waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_2_16/esp32_c6_touch_amoled_2_16.c
/*
 * SPDX-FileCopyrightText: 2026 Waveshare Team
 * SPDX-License-Identifier: Apache-2.0
 */
#include <assert.h>
#include <stdio.h>

#include "driver/spi_master.h"
#include "esp_check.h"
#include "esp_err.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_log.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "esp_codec_dev_defaults.h"
#include "esp_lcd_sh8601.h"
#include "esp_lcd_touch_cst9217.h"

#include "bsp/esp32_c6_touch_amoled_2_16.h"
#include "bsp_err_check.h"

static const char *TAG = "ESP32-C6-Touch-AMOLED-2.16";

static i2c_master_bus_handle_t i2c_handle;
static i2c_master_dev_handle_t pmu_handle;
static SemaphoreHandle_t pmu_mutex;
static bool i2c_initialized;
static bool pmu_initialized;
static bool spi2_initialized;

static i2s_chan_handle_t i2s_tx_chan;
static i2s_chan_handle_t i2s_rx_chan;
static const audio_codec_data_if_t *i2s_data_if;
static esp_codec_dev_handle_t speaker_codec;
static esp_codec_dev_handle_t microphone_codec;

static esp_lcd_panel_handle_t panel_handle;
static esp_lcd_panel_io_handle_t panel_io_handle;
static esp_lcd_touch_handle_t touch_handle;
#if (BSP_CONFIG_NO_GRAPHIC_LIB == 0)
static lv_indev_t *display_indev;
#endif
static uint8_t display_brightness;

sdmmc_card_t *bsp_sdcard;

/* AXP2101 registers used by this board. */
#define AXP2101_REG_STATUS1          (0x00)
#define AXP2101_REG_STATUS2          (0x01)
#define AXP2101_REG_CHIP_ID          (0x03)
#define AXP2101_REG_INPUT_CURRENT    (0x16)
#define AXP2101_REG_ADC_CHANNEL      (0x30)
#define AXP2101_REG_BAT_VOLTAGE_H    (0x34)
#define AXP2101_REG_BAT_VOLTAGE_L    (0x35)
#define AXP2101_REG_PRECHARGE        (0x61)
#define AXP2101_REG_CHARGE_CURRENT   (0x62)
#define AXP2101_REG_TERMINATION      (0x63)
#define AXP2101_REG_BAT_DETECTION    (0x68)
#define AXP2101_REG_DCDC_ONOFF       (0x80)
#define AXP2101_REG_DCDC1_VOLTAGE    (0x82)
#define AXP2101_REG_LDO_ONOFF        (0x90)
#define AXP2101_REG_ALDO1_VOLTAGE    (0x92)
#define AXP2101_REG_ALDO2_VOLTAGE    (0x93)
#define AXP2101_REG_ALDO3_VOLTAGE    (0x94)
#define AXP2101_REG_ALDO4_VOLTAGE    (0x95)
#define AXP2101_CHIP_ID              (0x4A)

#define AXP2101_VBUS_LIMIT_2000MA    (5U)
#define AXP2101_PRECHARGE_50MA       (2U)
#define AXP2101_CHARGE_500MA         (11U)
#define AXP2101_TERMINATION_50MA     (2U)

#define BSP_I2S_GPIO_CFG       \
    {                          \
        .mclk = BSP_I2S_MCLK,  \
        .bclk = BSP_I2S_SCLK,  \
        .ws = BSP_I2S_LCLK,    \
        .dout = BSP_I2S_DOUT,  \
        .din = BSP_I2S_DSIN,   \
        .invert_flags = {      \
            .mclk_inv = false, \
            .bclk_inv = false, \
            .ws_inv = false,   \
        },                     \
    }

#define BSP_I2S_DUPLEX_STEREO_CFG(_sample_rate)                                                   \
    {                                                                                              \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                                       \
        .slot_cfg = I2S_STD_MSB_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_32BIT, I2S_SLOT_MODE_STEREO), \
        .gpio_cfg = BSP_I2S_GPIO_CFG,                                                              \
    }

static const sh8601_lcd_init_cmd_t lcd_init_cmds[] = {
    {0x11, (uint8_t[]){0x00}, 0, 600},
    {0xFE, (uint8_t[]){0x20}, 1, 0},
    {0x19, (uint8_t[]){0x10}, 1, 0},
    {0x1C, (uint8_t[]){0xA0}, 1, 0},
    {0xFE, (uint8_t[]){0x00}, 1, 0},
    {0xC4, (uint8_t[]){0x80}, 1, 0},
    {0x3A, (uint8_t[]){0x55}, 1, 0},
    {0x35, (uint8_t[]){0x00}, 1, 0},
    {0x36, (uint8_t[]){0x30}, 1, 0},
    {0x53, (uint8_t[]){0x20}, 1, 0},
    {0x51, (uint8_t[]){0xFF}, 1, 0},
    {0x63, (uint8_t[]){0xFF}, 1, 0},
    {0x2A, (uint8_t[]){0x00, 0x00, 0x01, 0xDF}, 4, 0},
    {0x2B, (uint8_t[]){0x00, 0x00, 0x01, 0xDF}, 4, 0},
    {0x29, (uint8_t[]){0x00}, 0, 100},
};

static esp_err_t pmu_read_locked(uint8_t reg, uint8_t *value)
{
    return i2c_master_transmit_receive(pmu_handle, &reg, 1, value, 1, 100);
}

static esp_err_t pmu_write_locked(uint8_t reg, uint8_t value)
{
    const uint8_t data[] = {reg, value};
    return i2c_master_transmit(pmu_handle, data, sizeof(data), 100);
}

static esp_err_t pmu_update_locked(uint8_t reg, uint8_t mask, uint8_t value)
{
    uint8_t current;
    ESP_RETURN_ON_ERROR(pmu_read_locked(reg, &current), TAG, "Read AXP2101 register 0x%02X", reg);
    current = (current & (uint8_t)~mask) | (value & mask);
    return pmu_write_locked(reg, current);
}

static esp_err_t pmu_set_aldo_voltage_locked(uint8_t reg, uint16_t millivolts)
{
    ESP_RETURN_ON_FALSE(millivolts >= 500 && millivolts <= 3500 && millivolts % 100 == 0,
                        ESP_ERR_INVALID_ARG, TAG, "Invalid ALDO voltage: %u mV", millivolts);
    return pmu_update_locked(reg, 0x1F, (uint8_t)((millivolts - 500) / 100));
}

static esp_err_t pmu_set_ldo_power(uint8_t bit, bool enable)
{
    ESP_RETURN_ON_ERROR(bsp_pmu_init(), TAG, "PMU is unavailable");
    ESP_RETURN_ON_FALSE(xSemaphoreTake(pmu_mutex, pdMS_TO_TICKS(100)) == pdTRUE,
                        ESP_ERR_TIMEOUT, TAG, "Timed out waiting for PMU");
    const esp_err_t ret = pmu_update_locked(AXP2101_REG_LDO_ONOFF, (uint8_t)(1U << bit),
                                            enable ? (uint8_t)(1U << bit) : 0);
    xSemaphoreGive(pmu_mutex);
    return ret;
}

esp_err_t bsp_i2c_init(void)
{
    if (i2c_initialized) {
        return ESP_OK;
    }

    const i2c_master_bus_config_t config = {
        .i2c_port = BSP_I2C_NUM,
        .sda_io_num = BSP_I2C_SDA,
        .scl_io_num = BSP_I2C_SCL,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_new_master_bus(&config, &i2c_handle));
    i2c_initialized = true;
    return ESP_OK;
}

esp_err_t bsp_i2c_deinit(void)
{
    if (!i2c_initialized) {
        return ESP_OK;
    }
    if (pmu_handle != NULL) {
        BSP_ERROR_CHECK_RETURN_ERR(i2c_master_bus_rm_device(pmu_handle));
        pmu_handle = NULL;
        pmu_initialized = false;
    }
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_handle));
    i2c_handle = NULL;
    i2c_initialized = false;
    if (pmu_mutex != NULL) {
        vSemaphoreDelete(pmu_mutex);
        pmu_mutex = NULL;
    }
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_get_handle(void)
{
    return bsp_i2c_init() == ESP_OK ? i2c_handle : NULL;
}

esp_err_t bsp_pmu_init(void)
{
    if (pmu_initialized) {
        return ESP_OK;
    }
    ESP_RETURN_ON_ERROR(bsp_i2c_init(), TAG, "Failed to initialize I2C");

    if (pmu_mutex == NULL) {
        pmu_mutex = xSemaphoreCreateMutex();
        ESP_RETURN_ON_FALSE(pmu_mutex != NULL, ESP_ERR_NO_MEM, TAG, "Failed to create PMU mutex");
    }
    if (pmu_handle == NULL) {
        const i2c_device_config_t config = {
            .dev_addr_length = I2C_ADDR_BIT_LEN_7,
            .device_address = BSP_PMU_I2C_ADDRESS,
            .scl_speed_hz = 100000,
        };
        ESP_RETURN_ON_ERROR(i2c_master_bus_add_device(i2c_handle, &config, &pmu_handle),
                            TAG, "Failed to register AXP2101");
    }

    ESP_RETURN_ON_FALSE(xSemaphoreTake(pmu_mutex, pdMS_TO_TICKS(100)) == pdTRUE,
                        ESP_ERR_TIMEOUT, TAG, "Timed out waiting for PMU");
    esp_err_t ret;
    uint8_t chip_id;
    ret = pmu_read_locked(AXP2101_REG_CHIP_ID, &chip_id);
    if (ret != ESP_OK) {
        goto out;
    }
    if (chip_id != AXP2101_CHIP_ID) {
        ESP_LOGE(TAG, "Unexpected PMU chip ID: 0x%02X", chip_id);
        ret = ESP_ERR_NOT_FOUND;
        goto out;
    }

    /* Values are taken from the product schematic and factory examples. */
    if ((ret = pmu_update_locked(AXP2101_REG_INPUT_CURRENT, 0x07, AXP2101_VBUS_LIMIT_2000MA)) != ESP_OK ||
        (ret = pmu_write_locked(AXP2101_REG_DCDC1_VOLTAGE, (3300 - 1500) / 100)) != ESP_OK ||
        (ret = pmu_set_aldo_voltage_locked(AXP2101_REG_ALDO1_VOLTAGE, 3300)) != ESP_OK ||
        (ret = pmu_set_aldo_voltage_locked(AXP2101_REG_ALDO2_VOLTAGE, 3300)) != ESP_OK ||
        (ret = pmu_set_aldo_voltage_locked(AXP2101_REG_ALDO3_VOLTAGE, 3300)) != ESP_OK ||
        (ret = pmu_set_aldo_voltage_locked(AXP2101_REG_ALDO4_VOLTAGE, 1800)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_DCDC_ONOFF, 0x01, 0x01)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_LDO_ONOFF, 0x09, 0x09)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_PRECHARGE, 0x03, AXP2101_PRECHARGE_50MA)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_CHARGE_CURRENT, 0x1F, AXP2101_CHARGE_500MA)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_TERMINATION, 0x0F, AXP2101_TERMINATION_50MA)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_ADC_CHANNEL, 0x03, 0x01)) != ESP_OK ||
        (ret = pmu_update_locked(AXP2101_REG_BAT_DETECTION, 0x01, 0x01)) != ESP_OK) {
        goto out;
    }
    pmu_initialized = true;
    ESP_LOGI(TAG, "AXP2101 initialized");

out:
    xSemaphoreGive(pmu_mutex);
    return ret;
}

esp_err_t bsp_pmu_get_snapshot(bsp_pmu_snapshot_t *snapshot)
{
    ESP_RETURN_ON_FALSE(snapshot != NULL, ESP_ERR_INVALID_ARG, TAG, "Snapshot is required");
    ESP_RETURN_ON_ERROR(bsp_pmu_init(), TAG, "PMU is unavailable");
    ESP_RETURN_ON_FALSE(xSemaphoreTake(pmu_mutex, pdMS_TO_TICKS(100)) == pdTRUE,
                        ESP_ERR_TIMEOUT, TAG, "Timed out waiting for PMU");

    uint8_t status1;
    uint8_t status2;
    uint8_t voltage_h;
    uint8_t voltage_l;
    esp_err_t ret = pmu_read_locked(AXP2101_REG_STATUS1, &status1);
    if (ret == ESP_OK) {
        ret = pmu_read_locked(AXP2101_REG_STATUS2, &status2);
    }
    if (ret == ESP_OK) {
        ret = pmu_read_locked(AXP2101_REG_BAT_VOLTAGE_H, &voltage_h);
    }
    if (ret == ESP_OK) {
        ret = pmu_read_locked(AXP2101_REG_BAT_VOLTAGE_L, &voltage_l);
    }
    if (ret == ESP_OK) {
        snapshot->battery_present = (status1 & (1U << 3)) != 0;
        snapshot->charging = ((status2 >> 5) & 0x03) == 1;
        snapshot->charger_status = (bsp_pmu_charger_status_t)(status2 & 0x07);
        snapshot->battery_mv = (uint16_t)(((voltage_h & 0x1F) << 8) | voltage_l);
    }
    xSemaphoreGive(pmu_mutex);
    return ret;
}

