waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_2_16/esp32_c6_touch_amoled_2_16.c
const char *bsp_pmu_charger_status_to_string(bsp_pmu_charger_status_t status)
{
    switch (status) {
    case BSP_PMU_CHARGE_TRI_STATE:
        return "tri-state";
    case BSP_PMU_CHARGE_PRECHARGE:
        return "pre-charge";
    case BSP_PMU_CHARGE_CONSTANT_CURRENT:
        return "constant-current";
    case BSP_PMU_CHARGE_CONSTANT_VOLTAGE:
        return "constant-voltage";
    case BSP_PMU_CHARGE_DONE:
        return "done";
    case BSP_PMU_CHARGE_STOPPED:
        return "stopped";
    default:
        return "unknown";
    }
}

esp_err_t bsp_pmu_set_display_power(bool enable)
{
    return pmu_set_ldo_power(2, enable);
}

esp_err_t bsp_pmu_set_audio_power(bool enable)
{
    return pmu_set_ldo_power(1, enable);
}

static esp_err_t bsp_spi2_init(void)
{
    if (spi2_initialized) {
        return ESP_OK;
    }
    const int max_transfer_size = BSP_LCD_H_RES * BSP_LCD_V_RES * BSP_LCD_BITS_PER_PIXEL / 8;
    const spi_bus_config_t bus_config = SH8601_PANEL_BUS_QSPI_CONFIG(
        BSP_LCD_PCLK, BSP_LCD_DATA0, BSP_LCD_DATA1, BSP_LCD_DATA2, BSP_LCD_DATA3,
        max_transfer_size);
    BSP_ERROR_CHECK_RETURN_ERR(spi_bus_initialize(BSP_LCD_SPI_NUM, &bus_config, SPI_DMA_CH_AUTO));
    spi2_initialized = true;
    return ESP_OK;
}

esp_err_t bsp_spiffs_mount(void)
{
    const esp_vfs_spiffs_conf_t config = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };
    ESP_RETURN_ON_ERROR(esp_vfs_spiffs_register(&config), TAG, "Failed to mount SPIFFS");

    size_t total = 0;
    size_t used = 0;
    const esp_err_t ret = esp_spiffs_info(config.partition_label, &total, &used);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "SPIFFS: total=%zu used=%zu", total, used);
    }
    return ret;
}

esp_err_t bsp_spiffs_unmount(void)
{
    return esp_vfs_spiffs_unregister(CONFIG_BSP_SPIFFS_PARTITION_LABEL);
}

esp_err_t bsp_sdcard_mount(void)
{
    ESP_RETURN_ON_FALSE(bsp_sdcard == NULL, ESP_ERR_INVALID_STATE, TAG, "SD card is already mounted");
    ESP_RETURN_ON_ERROR(bsp_spi2_init(), TAG, "Failed to initialize shared SPI2 bus");

    const esp_vfs_fat_sdmmc_mount_config_t mount_config = {
#ifdef CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
        .max_files = 5,
        .allocation_unit_size = 16 * 1024,
    };
    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    host.slot = BSP_LCD_SPI_NUM;
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.host_id = BSP_LCD_SPI_NUM;
    slot_config.gpio_cs = BSP_SD_SDCS;

    const esp_err_t ret = esp_vfs_fat_sdspi_mount(BSP_SD_MOUNT_POINT, &host, &slot_config,
                                                   &mount_config, &bsp_sdcard);
    if (ret != ESP_OK) {
        bsp_sdcard = NULL;
    }
    return ret;
}

esp_err_t bsp_sdcard_unmount(void)
{
    ESP_RETURN_ON_FALSE(bsp_sdcard != NULL, ESP_ERR_INVALID_STATE, TAG, "SD card is not mounted");
    const esp_err_t ret = esp_vfs_fat_sdcard_unmount(BSP_SD_MOUNT_POINT, bsp_sdcard);
    if (ret == ESP_OK) {
        bsp_sdcard = NULL;
    }
    return ret;
}

esp_err_t bsp_audio_poweramp_enable(bool enable)
{
    return bsp_pmu_set_audio_power(enable);
}

esp_err_t bsp_audio_init(const i2s_std_config_t *i2s_config)
{
    if (i2s_data_if != NULL) {
        return ESP_OK;
    }

    i2s_chan_config_t channel_config = I2S_CHANNEL_DEFAULT_CONFIG(BSP_I2S_NUM, I2S_ROLE_MASTER);
    channel_config.auto_clear = true;
    ESP_RETURN_ON_ERROR(i2s_new_channel(&channel_config, &i2s_tx_chan, &i2s_rx_chan),
                        TAG, "Failed to create I2S channels");

    const i2s_std_config_t default_config = BSP_I2S_DUPLEX_STEREO_CFG(16000);
    const i2s_std_config_t *config = i2s_config != NULL ? i2s_config : &default_config;
    esp_err_t ret = i2s_channel_init_std_mode(i2s_tx_chan, config);
    if (ret == ESP_OK) {
        ret = i2s_channel_init_std_mode(i2s_rx_chan, config);
    }
    if (ret == ESP_OK) {
        ret = i2s_channel_enable(i2s_tx_chan);
    }
    if (ret == ESP_OK) {
        ret = i2s_channel_enable(i2s_rx_chan);
    }
    if (ret != ESP_OK) {
        if (i2s_tx_chan != NULL) {
            (void)i2s_channel_disable(i2s_tx_chan);
            (void)i2s_del_channel(i2s_tx_chan);
            i2s_tx_chan = NULL;
        }
        if (i2s_rx_chan != NULL) {
            (void)i2s_channel_disable(i2s_rx_chan);
            (void)i2s_del_channel(i2s_rx_chan);
            i2s_rx_chan = NULL;
        }
        return ret;
    }

    audio_codec_i2s_cfg_t codec_i2s_config = {
        .port = BSP_I2S_NUM,
        .rx_handle = i2s_rx_chan,
        .tx_handle = i2s_tx_chan,
    };
    i2s_data_if = audio_codec_new_i2s_data(&codec_i2s_config);
    return i2s_data_if != NULL ? ESP_OK : ESP_ERR_NO_MEM;
}

esp_codec_dev_handle_t bsp_audio_codec_speaker_init(void)
{
    if (speaker_codec != NULL) {
        return speaker_codec;
    }
    if (bsp_i2c_init() != ESP_OK || bsp_audio_init(NULL) != ESP_OK ||
        bsp_audio_poweramp_enable(true) != ESP_OK) {
        return NULL;
    }

    const audio_codec_gpio_if_t *gpio_if = audio_codec_new_gpio();
    BSP_NULL_CHECK(gpio_if, NULL);
    audio_codec_i2c_cfg_t i2c_config = {
        .port = BSP_I2C_NUM,
        .addr = BSP_AUDIO_OUT_I2C_ADDR,
        .bus_handle = i2c_handle,
    };
    const audio_codec_ctrl_if_t *control_if = audio_codec_new_i2c_ctrl(&i2c_config);
    BSP_NULL_CHECK(control_if, NULL);

    esp_codec_dev_hw_gain_t gain = {
        .pa_voltage = 5.0,
        .codec_dac_voltage = 3.3,
    };
    es8311_codec_cfg_t codec_config = {
        .ctrl_if = control_if,
        .gpio_if = gpio_if,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_DAC,
        .pa_pin = GPIO_NUM_NC,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = gain,
    };
    const audio_codec_if_t *codec_if = es8311_codec_new(&codec_config);
    BSP_NULL_CHECK(codec_if, NULL);
    esp_codec_dev_cfg_t device_config = {
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
        .codec_if = codec_if,
        .data_if = i2s_data_if,
    };
    speaker_codec = esp_codec_dev_new(&device_config);
    return speaker_codec;
}

esp_codec_dev_handle_t bsp_audio_codec_microphone_init(void)
{
    if (microphone_codec != NULL) {
        return microphone_codec;
    }
    if (bsp_i2c_init() != ESP_OK || bsp_audio_init(NULL) != ESP_OK) {
        return NULL;
    }

