waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_2_16/esp32_c6_touch_amoled_2_16.c
    audio_codec_i2c_cfg_t i2c_config = {
        .port = BSP_I2C_NUM,
        .addr = BSP_AUDIO_IN_I2C_ADDR,
        .bus_handle = i2c_handle,
    };
    const audio_codec_ctrl_if_t *control_if = audio_codec_new_i2c_ctrl(&i2c_config);
    BSP_NULL_CHECK(control_if, NULL);
    es7210_codec_cfg_t codec_config = {
        .ctrl_if = control_if,
    };
    const audio_codec_if_t *codec_if = es7210_codec_new(&codec_config);
    BSP_NULL_CHECK(codec_if, NULL);
    esp_codec_dev_cfg_t device_config = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .codec_if = codec_if,
        .data_if = i2s_data_if,
    };
    microphone_codec = esp_codec_dev_new(&device_config);
    return microphone_codec;
}

esp_err_t bsp_display_brightness_init(void)
{
    return bsp_display_brightness_set(100);
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    ESP_RETURN_ON_FALSE(panel_io_handle != NULL, ESP_ERR_INVALID_STATE, TAG, "Display is not initialized");
    ESP_RETURN_ON_FALSE(brightness_percent >= 0 && brightness_percent <= 100,
                        ESP_ERR_INVALID_ARG, TAG, "Brightness must be in the range 0..100");

    const uint32_t command = ((uint32_t)0x02 << 24) | ((uint32_t)0x51 << 8);
    const uint8_t value = (uint8_t)(brightness_percent * 255 / 100);
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(panel_io_handle, command, &value, 1), TAG, "");
    display_brightness = value;
    return ESP_OK;
}

int bsp_display_brightness_get(void)
{
    return panel_io_handle != NULL ? display_brightness * 100 / 255 : -1;
}

esp_err_t bsp_display_backlight_on(void)
{
    return bsp_display_brightness_set(100);
}

esp_err_t bsp_display_backlight_off(void)
{
    return bsp_display_brightness_set(0);
}

esp_err_t bsp_display_new(const bsp_display_config_t *config,
                          esp_lcd_panel_handle_t *ret_panel,
                          esp_lcd_panel_io_handle_t *ret_io)
{
    (void)config;
    ESP_RETURN_ON_FALSE(panel_handle == NULL && panel_io_handle == NULL,
                        ESP_ERR_INVALID_STATE, TAG, "Display is already initialized");
    ESP_RETURN_ON_ERROR(bsp_pmu_init(), TAG, "Failed to initialize PMU");
    ESP_RETURN_ON_ERROR(bsp_pmu_set_display_power(false), TAG, "Failed to reset display power");
    vTaskDelay(pdMS_TO_TICKS(100));
    ESP_RETURN_ON_ERROR(bsp_pmu_set_display_power(true), TAG, "Failed to enable display power");
    vTaskDelay(pdMS_TO_TICKS(100));
    ESP_RETURN_ON_ERROR(bsp_spi2_init(), TAG, "Failed to initialize shared SPI2 bus");

    const esp_lcd_panel_io_spi_config_t io_config =
        SH8601_PANEL_IO_QSPI_CONFIG(BSP_LCD_CS, NULL, NULL);
    ESP_RETURN_ON_ERROR(
        esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)BSP_LCD_SPI_NUM, &io_config,
                                 &panel_io_handle),
        TAG, "Failed to create SH8601 panel IO");

    const sh8601_vendor_config_t vendor_config = {
        .init_cmds = lcd_init_cmds,
        .init_cmds_size = sizeof(lcd_init_cmds) / sizeof(lcd_init_cmds[0]),
        .flags.use_qspi_interface = 1,
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };
    esp_err_t ret = esp_lcd_new_panel_sh8601(panel_io_handle, &panel_config, &panel_handle);
    if (ret == ESP_OK) {
        ret = esp_lcd_panel_reset(panel_handle);
    }
    if (ret == ESP_OK) {
        ret = esp_lcd_panel_init(panel_handle);
    }
    if (ret == ESP_OK) {
        ret = esp_lcd_panel_disp_on_off(panel_handle, true);
    }
    if (ret != ESP_OK) {
        if (panel_handle != NULL) {
            (void)esp_lcd_panel_del(panel_handle);
            panel_handle = NULL;
        }
        if (panel_io_handle != NULL) {
            (void)esp_lcd_panel_io_del(panel_io_handle);
            panel_io_handle = NULL;
        }
        return ret;
    }

    if (ret_panel != NULL) {
        *ret_panel = panel_handle;
    }
    if (ret_io != NULL) {
        *ret_io = panel_io_handle;
    }
    return ESP_OK;
}

esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    ESP_RETURN_ON_FALSE(ret_touch != NULL, ESP_ERR_INVALID_ARG, TAG, "Touch output is required");
    ESP_RETURN_ON_ERROR(bsp_i2c_init(), TAG, "Failed to initialize I2C");

    const bsp_touch_config_t default_config = {
        .swap_xy = true,
        .mirror_x = false,
        .mirror_y = true,
    };
    const bsp_touch_config_t *touch_config = config != NULL ? config : &default_config;
    const esp_lcd_touch_config_t driver_config = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = BSP_LCD_TOUCH_RST,
        .int_gpio_num = BSP_LCD_TOUCH_INT,
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = touch_config->swap_xy,
            .mirror_x = touch_config->mirror_x,
            .mirror_y = touch_config->mirror_y,
        },
    };
    esp_lcd_panel_io_i2c_config_t io_config = ESP_LCD_TOUCH_IO_I2C_CST9217_CONFIG();
    io_config.scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ;
    esp_lcd_panel_io_handle_t touch_io = NULL;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config, &touch_io), TAG, "");
    return esp_lcd_touch_new_i2c_cst9217(touch_io, &driver_config, ret_touch);
}

#if (BSP_CONFIG_NO_GRAPHIC_LIB == 0)
#if LVGL_VERSION_MAJOR >= 9
static void rounder_event_cb(lv_event_t *event)
{
    lv_area_t *area = (lv_area_t *)lv_event_get_param(event);
    area->x1 = (area->x1 >> 1) << 1;
    area->y1 = (area->y1 >> 1) << 1;
    area->x2 = ((area->x2 >> 1) << 1) + 1;
    area->y2 = ((area->y2 >> 1) << 1) + 1;
}
#else
static void rounder_cb(lv_disp_drv_t *display_driver, lv_area_t *area)
{
    (void)display_driver;
    area->x1 = (area->x1 >> 1) << 1;
    area->y1 = (area->y1 >> 1) << 1;
    area->x2 = ((area->x2 >> 1) << 1) + 1;
    area->y2 = ((area->y2 >> 1) << 1) + 1;
}
#endif

