waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_2_16/esp32_c6_touch_amoled_2_16.c
static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *config)
{
    const bsp_display_config_t panel_config = {
        .max_transfer_sz = BSP_LCD_H_RES * BSP_LCD_V_RES * BSP_LCD_BITS_PER_PIXEL / 8,
    };
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new(&panel_config, &panel_handle, &panel_io_handle));

    esp_lv_adapter_display_config_t display_config = {
        .panel = panel_handle,
        .panel_io = panel_io_handle,
        .profile = {
            .interface = ESP_LV_ADAPTER_PANEL_IF_OTHER,
            .rotation = config->rotation,
            .hor_res = BSP_LCD_H_RES,
            .ver_res = BSP_LCD_V_RES,
            .buffer_height = CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT,
            .use_psram = false,
            .enable_ppa_accel = false,
            .require_double_buffer = false,
        },
        .tear_avoid_mode = config->tear_avoid_mode,
    };
    lv_display_t *display = esp_lv_adapter_register_display(&display_config);
    if (display == NULL) {
        return NULL;
    }
#if LVGL_VERSION_MAJOR >= 9
    lv_display_add_event_cb(display, rounder_event_cb, LV_EVENT_INVALIDATE_AREA, NULL);
#else
    lv_disp_t *display_v8 = (lv_disp_t *)display;
    if (display_v8->driver != NULL) {
        display_v8->driver->rounder_cb = rounder_cb;
    }
#endif
    return display;
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t config = {
        .lv_adapter_cfg = ESP_LV_ADAPTER_DEFAULT_CONFIG(),
        .rotation = ESP_LV_ADAPTER_ROTATE_0,
        .tear_avoid_mode = ESP_LV_ADAPTER_TEAR_AVOID_MODE_NONE,
        .touch = {
            .swap_xy = true,
            .mirror_x = false,
            .mirror_y = true,
        },
    };
    return bsp_display_start_with_config(&config);
}

lv_display_t *bsp_display_start_with_config(bsp_display_cfg_t *config)
{
    ESP_RETURN_ON_FALSE(config != NULL, NULL, TAG, "Display configuration is required");
    BSP_ERROR_CHECK_RETURN_NULL(esp_lv_adapter_init(&config->lv_adapter_cfg));

    lv_display_t *display = bsp_display_lcd_init(config);
    BSP_NULL_CHECK(display, NULL);
    BSP_ERROR_CHECK_RETURN_NULL(bsp_touch_new(&config->touch, &touch_handle));

    esp_lv_adapter_touch_config_t touch_config =
        ESP_LV_ADAPTER_TOUCH_DEFAULT_CONFIG(display, touch_handle);
    display_indev = esp_lv_adapter_register_touch(&touch_config);
    BSP_NULL_CHECK(display_indev, NULL);
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_brightness_init());
    BSP_ERROR_CHECK_RETURN_NULL(esp_lv_adapter_start());
    return display;
}

lv_indev_t *bsp_display_get_input_dev(void)
{
    return display_indev;
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    const int32_t adapter_timeout_ms = timeout_ms == 0 ? -1 :
                                       timeout_ms > INT32_MAX ? INT32_MAX : (int32_t)timeout_ms;
    return esp_lv_adapter_lock(adapter_timeout_ms) == ESP_OK;
}

void bsp_display_unlock(void)
{
    esp_lv_adapter_unlock();
}
#endif
